from Lab12.classes.nasa import nasa_db
from Lab12.classes.reaction import Reaction

"""Вариант 23. 2H20(г) + 2Cl2 = 4HCl + O2"""

T = 298

r = Reaction("2H20(г) + 2Cl2 => 4HCl + O2")

nasa_db.add_NASA_data(
    [
        "H20(г) 0.41986352E+01 -0.20364017E-02 0.65203416E-05 -0.54879269E-08 0.17719680E-11 -0.30293726E+05 -0.84900901E+00",
        "Cl2 2.73638114E+00 7.83525699E-03 -1.45104963E-05 1.25730834E-08 -4.13247143E-12 -1.05880114E+03 9.44557148E+00",
        "HCl 0.34637647E+01 0.47648423E-03 -0.20030122E-05 0.33171437E-08 -0.14495818E-11 -0.12144352E+05 0.26642828E+01",
        "O2 0.03212936E+02 0.01127486E-01 -0.05756150E-05 0.01313877E-07 -0.08768554E-11 -0.01005249E+05 0.06034738E+02",
    ]
)


if __name__ == "__main__":
    enthalpy = r.get_enthalpy(T)

    print(f"Энтальпия: {enthalpy}")

    if enthalpy > 0:
        print("Энтальпия положительная. Значит реакция эндотермическая")
    else:
        print("Энтальпия отрицательная. Значит реакция экзотермическая")
